create_generated_clock -name u_seven_seg/slowclk -source [get_pins u_clk_wiz/inst/mmcm_adv_inst/CLKOUT2] -divide_by 32768 [get_pins {u_seven_seg/clk_div_counter_reg[14]/Q}]
create_generated_clock -name SCK -source [get_pins u_qspi_sram_ctrl/clk_output_buffer/C] -divide_by 1 -invert [get_ports SCK]
create_clock -period 100.000 -name VIRTUAL_clk_out10_clk_wiz_0 -waveform {0.000 50.000}
set_input_delay -clock [get_clocks VIRTUAL_clk_out10_clk_wiz_0] -min -add_delay 50.730 [get_ports HOLD_N_SIO3]
set_input_delay -clock [get_clocks VIRTUAL_clk_out10_clk_wiz_0] -max -add_delay 75.870 [get_ports HOLD_N_SIO3]
set_input_delay -clock [get_clocks VIRTUAL_clk_out10_clk_wiz_0] -min -add_delay 50.730 [get_ports SIO2]
set_input_delay -clock [get_clocks VIRTUAL_clk_out10_clk_wiz_0] -max -add_delay 75.870 [get_ports SIO2]
set_input_delay -clock [get_clocks VIRTUAL_clk_out10_clk_wiz_0] -min -add_delay 50.730 [get_ports SI_SIO0]
set_input_delay -clock [get_clocks VIRTUAL_clk_out10_clk_wiz_0] -max -add_delay 75.870 [get_ports SI_SIO0]
set_input_delay -clock [get_clocks VIRTUAL_clk_out10_clk_wiz_0] -min -add_delay 50.730 [get_ports SO_SIO1]
set_input_delay -clock [get_clocks VIRTUAL_clk_out10_clk_wiz_0] -max -add_delay 75.870 [get_ports SO_SIO1]
set_output_delay -clock [get_clocks SCK] -min -add_delay -49.270 [get_ports CS_N]
set_output_delay -clock [get_clocks SCK] -max -add_delay 25.870 [get_ports CS_N]
set_output_delay -clock [get_clocks SCK] -min -add_delay -9.270 [get_ports HOLD_N_SIO3]
set_output_delay -clock [get_clocks SCK] -max -add_delay 10.870 [get_ports HOLD_N_SIO3]
set_output_delay -clock [get_clocks SCK] -min -add_delay -9.270 [get_ports SIO2]
set_output_delay -clock [get_clocks SCK] -max -add_delay 10.870 [get_ports SIO2]
set_output_delay -clock [get_clocks SCK] -min -add_delay -9.270 [get_ports SI_SIO0]
set_output_delay -clock [get_clocks SCK] -max -add_delay 10.870 [get_ports SI_SIO0]
set_output_delay -clock [get_clocks SCK] -min -add_delay -9.270 [get_ports SO_SIO1]
set_output_delay -clock [get_clocks SCK] -max -add_delay 10.870 [get_ports SO_SIO1]
